#include <iostream>
using namespace std;
/*
לקניית  100 כרטיסי קולנוע נדרשו 400 ש"ח.   מחיר הכרטיסים: 3, 10 ו15- ש"ח.          
כתוב תכנית המוצא את כמות הכרטיסים שנקנו מכל סוג.
//*/

int main() {
	int n15,n10,n3;
	//הלולאות מקוננות כך שאילו היו כמה פתרונות - כולם היו מוצגים, לדוגמא אם תשנה את ה100 ל50 תקבל 3 פתרונות
	for (n15 = 400 / 15; n15 > -1; n15--)
		for (n10 = (400 - n15 * 15) / 10; n10 > -1; n10--)
			for (n3 = (400 - n15 * 15 - n10 * 10) / 3; n3 > -1; n3--)
				if (n15 * 15 + n10 * 10 + n3 * 3 == 400 && n15 + n10 + n3 == 100)
					cout << "n3 = " << n3 << ", n10 = " << n10 << ", n15 = " << n15 << endl;
	

	cout << endl;
	system ("pause");
	return 0;
}